#!/bin/bash

# Да се напише Shell скрипта која ќе ги копира сите
# датотеки од именик зададен како прв аргумент кои
# започнуваат на број, по што следуваат само мали
# букви и имаат екстензија .out, во именик зададен како
# втор аргумент од командна линија
# Потоа да се пресмета и да се испечати вкупната
# големина на ископираните датотеки за кои
# корисникот има привилегии за извршување.
#  Доколку аргументите не се наведени, да се испише
# упатство за користење на скриптата, а ако не постои
# именикот зададен како втор аргумент, да се креира.

if [ $# -ne 2 ]
then
        echo "Invalid usage"
        exit 1
fi

if [ ! -d "$2" ]
then
        mkdir "$2"
fi

for f in `ls "$1" | grep '^[0-9][a-z][a-z]*\.txt$'`
do
        if [ -f "$f" ]
        then
                cp "$f" "$2/$f"
        fi
done

vkupno=0
# shellcheck disable=SC2045
for i in `ls "$2"`
do
        if [ -x "$2/$i" ]
        then
                size=`ls -l "$2/$i" | awk '{print $6}'`
                vkupno=$(($vkupno + $size))
        fi
done
echo $vkupno


