#!/bin/bash

# Потребно е да се направат одередни манипулации врз
# податоците кои ни се дадени за одердени комичари.
# Податоци за: име, презиме, датум на започнување на емисијата
# која ја водат, име на телевизиската куќа која им е домаќин.
# Потребно е да се напише скрипта со која ќе се најдат сите
# комичари кои ја започнале нивната емисија на денешен ден, 27ми
# јануари, а кои работат за телевизиската куќа која се праќа
# како аргумент на скриптата. Треба да се испечати името и презимето
# на комичарот

day=` date | awk '{print $3}'`

if [ $# -ne 1 ]
then
  echo "Invalid usage"
  exit 1
fi

IFS=$'\n'
for f in `cat comedians.txt | awk '{print $1, $2, $4, $NF;}'`
do
        tv=`echo "$f" | awk '{print $NF;}'`
        fday=`echo "$f" | awk '{print $3}'`
        if [ "$tv" = "$1" -a "$fday" = "$day" ]
        then
                echo "$f" | awk '{print $1, $2}'
        fi
done