#!/bin/bash

# Потребно е да направат одредени манипулации врз податоците за вработените
# кои дадена компанија ни ги проследува, секогаш во ист формат. На овој
# начин за секој вработен ги имаме податоците име, презиме, датум на
# вработување, град и земја каде се наоѓа канцеларијата каде работи.
# Нека во моментов работиме со фајлот CocaCola.txt кој ги содржи податоците
# Потребно е да ги најдеме сите вработени кои се вработиле во компанијата на денешен
# ден без разлика на тоа во која година го оствариле вработувањето.
# Поточно, потребно е да се испечатат името и презимето на вработениот,
# заедно со податоците за канцеларијата во која работи - за сите вработени кои
# го исполнуваат условот

day=`date | awk '{print $3}'`
month=`date | awk '{print $2}'`

IFS=$'\n'

for f in `cat CocaCola.txt`
do
        fday=`echo "$f" | awk '{print $4}'`
        fmonth=`echo "$f" | awk '{print $3}'`
        if [ "$fday" = "$day" -a "$fmonth" = "$month" ]
        then
                echo "$f" | awk '{print $1, $2, $6, $NF}'
        fi
done
