#!/bin/bash

# Напишете Shell скрипта со која во датотеката out.txt ќе
# го запише вкупното време, во минути, кое одреден
# корисник (прв аргумент на скриптата) бил најавен.
#  Ако не е проследен аргументот, да се прикаже
# упатство за користење на скриптата.
#  Доколку излезната датотека постои, потребно е да се
# пребрише.
#  На крајот од скриптата да се прикаже содржината на
# датотеката out.txt.

if [ ! $# -eq 1 ]
then
  echo "Invalid usage"
  exit 1
fi

vkupno=0
for m in `last | grep "$1" | awk '{print $NF;}' | sed -e 's/(//' | sed 's/)//' | grep -v "in" | awk -F\: 'BEGIN{min=0} {min+=60*$1 + $2} END{print min}'`
do
        vkupno=$(($vkupno + $m))
done
echo $vkupno


