#!/bin/bash

# Да се напише Shell скрипта која ќе ги организира датотеките од тековниот
# именик според екстензијата. Организацијата се врши преку копирање на
# датотеките во соодветни именици, чии имиња се еднакви на екстензиите.
# Имениците треба да се преместат во именик чија локација е зададена како
# прв аргумент на скриптата. Доколку овој именик не постои да се креира.
# 1. Пример: Именикот argument/mp3/ треба да ги содржи сите .mp3 датотеки, додека пак
# именикот argument/jpg/ треба да ги содржи сите .jpg датотеки.

if [ ! $# -eq 1 ]
then
        echo "Invalid usage!"
        exit 1
fi

for f in `ls`
do
        if [ -f "$f" ]
        then
                ext=`echo "$f" | awk -F\. '{print $2}'`
                if [ ! -d "$1/$ext" ]
                then
                        mkdir -p "$1/$ext"
                fi
                cp "$f" "$1/$ext/"
        fi

done





